esp8266/Arduino/boards.txt
##############################################################
esp8285.name=Generic ESP8285 Module
esp8285.build.board=ESP8266_ESP01
esp8285.build.variant=esp8285
esp8285.upload.tool=esptool
esp8285.upload.maximum_data_size=81920
esp8285.upload.wait_for_upload_port=true
esp8285.upload.erase_cmd=
esp8285.serial.disableDTR=true
esp8285.serial.disableRTS=true
esp8285.build.mcu=esp8266
esp8285.build.core=esp8266
esp8285.build.spiffs_pagesize=256
esp8285.build.debug_port=
esp8285.build.debug_level=
esp8285.menu.xtal.80=80 MHz
esp8285.menu.xtal.80.build.f_cpu=80000000L
esp8285.menu.xtal.160=160 MHz
esp8285.menu.xtal.160.build.f_cpu=160000000L
esp8285.menu.vt.flash=Flash
esp8285.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
esp8285.menu.vt.heap=Heap
esp8285.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
esp8285.menu.vt.iram=IRAM
esp8285.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
esp8285.menu.exception.legacy=Legacy (new can return nullptr)
esp8285.menu.exception.legacy.build.exception_flags=-fno-exceptions
esp8285.menu.exception.legacy.build.stdcpp_lib=-lstdc++
esp8285.menu.exception.disabled=Disabled (new can abort)
esp8285.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
esp8285.menu.exception.disabled.build.stdcpp_lib=-lstdc++
esp8285.menu.exception.enabled=Enabled
esp8285.menu.exception.enabled.build.exception_flags=-fexceptions
esp8285.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
esp8285.menu.stacksmash.disabled=Disabled
esp8285.menu.stacksmash.disabled.build.stacksmash_flags=
esp8285.menu.stacksmash.enabled=Enabled
esp8285.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
esp8285.menu.ssl.all=All SSL ciphers (most compatible)
esp8285.menu.ssl.all.build.sslflags=
esp8285.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
esp8285.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
esp8285.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
esp8285.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
esp8285.menu.ResetMethod.ck=no dtr (aka ck)
esp8285.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
esp8285.menu.ResetMethod.nodtr_nosync=no dtr, no_sync
esp8285.menu.ResetMethod.nodtr_nosync.upload.resetmethod=--before no_reset_no_sync --after soft_reset
esp8285.menu.CrystalFreq.26=26 MHz
esp8285.menu.CrystalFreq.40=40 MHz
esp8285.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
esp8285.build.flash_mode=dout
esp8285.build.flash_flags=-DFLASHMODE_DOUT
esp8285.build.flash_freq=40
esp8285.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
esp8285.menu.eesz.1M64.build.flash_size=1M
esp8285.menu.eesz.1M64.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
esp8285.menu.eesz.1M64.build.spiffs_pagesize=256
esp8285.menu.eesz.1M64.upload.maximum_size=958448
esp8285.menu.eesz.1M64.build.rfcal_addr=0xFC000
esp8285.menu.eesz.1M64.build.spiffs_start=0xEB000
esp8285.menu.eesz.1M64.build.spiffs_end=0xFB000
esp8285.menu.eesz.1M64.build.spiffs_blocksize=4096
esp8285.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
esp8285.menu.eesz.1M128.build.flash_size=1M
esp8285.menu.eesz.1M128.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
esp8285.menu.eesz.1M128.build.spiffs_pagesize=256
esp8285.menu.eesz.1M128.upload.maximum_size=892912
esp8285.menu.eesz.1M128.build.rfcal_addr=0xFC000
esp8285.menu.eesz.1M128.build.spiffs_start=0xDB000
esp8285.menu.eesz.1M128.build.spiffs_end=0xFB000
esp8285.menu.eesz.1M128.build.spiffs_blocksize=4096
esp8285.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
esp8285.menu.eesz.1M144.build.flash_size=1M
esp8285.menu.eesz.1M144.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
esp8285.menu.eesz.1M144.build.spiffs_pagesize=256
esp8285.menu.eesz.1M144.upload.maximum_size=876528
esp8285.menu.eesz.1M144.build.rfcal_addr=0xFC000
esp8285.menu.eesz.1M144.build.spiffs_start=0xD7000
esp8285.menu.eesz.1M144.build.spiffs_end=0xFB000
esp8285.menu.eesz.1M144.build.spiffs_blocksize=4096
esp8285.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
esp8285.menu.eesz.1M160.build.flash_size=1M
esp8285.menu.eesz.1M160.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
esp8285.menu.eesz.1M160.build.spiffs_pagesize=256
esp8285.menu.eesz.1M160.upload.maximum_size=860144
esp8285.menu.eesz.1M160.build.rfcal_addr=0xFC000
esp8285.menu.eesz.1M160.build.spiffs_start=0xD3000
esp8285.menu.eesz.1M160.build.spiffs_end=0xFB000
esp8285.menu.eesz.1M160.build.spiffs_blocksize=4096
esp8285.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
esp8285.menu.eesz.1M192.build.flash_size=1M
esp8285.menu.eesz.1M192.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
esp8285.menu.eesz.1M192.build.spiffs_pagesize=256
esp8285.menu.eesz.1M192.upload.maximum_size=827376
esp8285.menu.eesz.1M192.build.rfcal_addr=0xFC000
esp8285.menu.eesz.1M192.build.spiffs_start=0xCB000
esp8285.menu.eesz.1M192.build.spiffs_end=0xFB000
esp8285.menu.eesz.1M192.build.spiffs_blocksize=4096
esp8285.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
esp8285.menu.eesz.1M256.build.flash_size=1M
esp8285.menu.eesz.1M256.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
esp8285.menu.eesz.1M256.build.spiffs_pagesize=256
esp8285.menu.eesz.1M256.upload.maximum_size=761840
esp8285.menu.eesz.1M256.build.rfcal_addr=0xFC000
esp8285.menu.eesz.1M256.build.spiffs_start=0xBB000
esp8285.menu.eesz.1M256.build.spiffs_end=0xFB000
esp8285.menu.eesz.1M256.build.spiffs_blocksize=4096
esp8285.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
esp8285.menu.eesz.1M512.build.flash_size=1M
esp8285.menu.eesz.1M512.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
esp8285.menu.eesz.1M512.build.spiffs_pagesize=256
esp8285.menu.eesz.1M512.upload.maximum_size=499696
esp8285.menu.eesz.1M512.build.rfcal_addr=0xFC000
esp8285.menu.eesz.1M512.build.spiffs_start=0x7B000
esp8285.menu.eesz.1M512.build.spiffs_end=0xFB000
esp8285.menu.eesz.1M512.build.spiffs_blocksize=8192
esp8285.menu.eesz.1M=1MB (FS:none OTA:~502KB)
esp8285.menu.eesz.1M.build.flash_size=1M
esp8285.menu.eesz.1M.build.flash_size_bytes=0x100000
esp8285.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
esp8285.menu.eesz.1M.build.spiffs_pagesize=256
esp8285.menu.eesz.1M.upload.maximum_size=1023984
esp8285.menu.eesz.1M.build.rfcal_addr=0xFC000
esp8285.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
esp8285.menu.eesz.2M64.build.flash_size=2M
esp8285.menu.eesz.2M64.build.flash_size_bytes=0x200000
esp8285.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
esp8285.menu.eesz.2M64.build.spiffs_pagesize=256
esp8285.menu.eesz.2M64.upload.maximum_size=1044464
esp8285.menu.eesz.2M64.build.rfcal_addr=0x1FC000
esp8285.menu.eesz.2M64.build.spiffs_start=0x1F0000
esp8285.menu.eesz.2M64.build.spiffs_end=0x1FB000
esp8285.menu.eesz.2M64.build.spiffs_blocksize=4096
esp8285.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
esp8285.menu.eesz.2M128.build.flash_size=2M
esp8285.menu.eesz.2M128.build.flash_size_bytes=0x200000
esp8285.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
esp8285.menu.eesz.2M128.build.spiffs_pagesize=256
esp8285.menu.eesz.2M128.upload.maximum_size=1044464
esp8285.menu.eesz.2M128.build.rfcal_addr=0x1FC000
esp8285.menu.eesz.2M128.build.spiffs_start=0x1E0000
esp8285.menu.eesz.2M128.build.spiffs_end=0x1FB000
esp8285.menu.eesz.2M128.build.spiffs_blocksize=4096
esp8285.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
esp8285.menu.eesz.2M256.build.flash_size=2M
esp8285.menu.eesz.2M256.build.flash_size_bytes=0x200000
esp8285.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
esp8285.menu.eesz.2M256.build.spiffs_pagesize=256
esp8285.menu.eesz.2M256.upload.maximum_size=1044464
esp8285.menu.eesz.2M256.build.rfcal_addr=0x1FC000
esp8285.menu.eesz.2M256.build.spiffs_start=0x1C0000
esp8285.menu.eesz.2M256.build.spiffs_end=0x1FB000
esp8285.menu.eesz.2M256.build.spiffs_blocksize=4096
esp8285.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
esp8285.menu.eesz.2M512.build.flash_size=2M
esp8285.menu.eesz.2M512.build.flash_size_bytes=0x200000
esp8285.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
esp8285.menu.eesz.2M512.build.spiffs_pagesize=256
esp8285.menu.eesz.2M512.upload.maximum_size=1044464
esp8285.menu.eesz.2M512.build.rfcal_addr=0x1FC000
esp8285.menu.eesz.2M512.build.spiffs_start=0x180000
esp8285.menu.eesz.2M512.build.spiffs_end=0x1FA000
esp8285.menu.eesz.2M512.build.spiffs_blocksize=8192
esp8285.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
esp8285.menu.eesz.2M1M.build.flash_size=2M
esp8285.menu.eesz.2M1M.build.flash_size_bytes=0x200000
esp8285.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
esp8285.menu.eesz.2M1M.build.spiffs_pagesize=256
esp8285.menu.eesz.2M1M.upload.maximum_size=1044464
esp8285.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
esp8285.menu.eesz.2M1M.build.spiffs_start=0x100000
esp8285.menu.eesz.2M1M.build.spiffs_end=0x1FA000
esp8285.menu.eesz.2M1M.build.spiffs_blocksize=8192
esp8285.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
esp8285.menu.eesz.2M.build.flash_size=2M
esp8285.menu.eesz.2M.build.flash_size_bytes=0x200000
esp8285.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
esp8285.menu.eesz.2M.build.spiffs_pagesize=256
esp8285.menu.eesz.2M.upload.maximum_size=1044464
esp8285.menu.eesz.2M.build.rfcal_addr=0x1FC000
esp8285.menu.led.2=2
esp8285.menu.led.2.build.led=-DLED_BUILTIN=2
esp8285.menu.led.0=0
esp8285.menu.led.0.build.led=-DLED_BUILTIN=0
esp8285.menu.led.1=1
esp8285.menu.led.1.build.led=-DLED_BUILTIN=1
esp8285.menu.led.3=3
esp8285.menu.led.3.build.led=-DLED_BUILTIN=3
esp8285.menu.led.4=4
esp8285.menu.led.4.build.led=-DLED_BUILTIN=4
esp8285.menu.led.5=5
esp8285.menu.led.5.build.led=-DLED_BUILTIN=5
esp8285.menu.led.6=6
esp8285.menu.led.6.build.led=-DLED_BUILTIN=6
esp8285.menu.led.7=7
esp8285.menu.led.7.build.led=-DLED_BUILTIN=7
esp8285.menu.led.8=8
esp8285.menu.led.8.build.led=-DLED_BUILTIN=8
esp8285.menu.led.9=9
esp8285.menu.led.9.build.led=-DLED_BUILTIN=9
esp8285.menu.led.10=10
esp8285.menu.led.10.build.led=-DLED_BUILTIN=10
esp8285.menu.led.11=11
esp8285.menu.led.11.build.led=-DLED_BUILTIN=11
esp8285.menu.led.12=12
esp8285.menu.led.12.build.led=-DLED_BUILTIN=12
esp8285.menu.led.13=13
esp8285.menu.led.13.build.led=-DLED_BUILTIN=13
esp8285.menu.led.14=14
esp8285.menu.led.14.build.led=-DLED_BUILTIN=14
esp8285.menu.led.15=15
esp8285.menu.led.15.build.led=-DLED_BUILTIN=15
esp8285.menu.led.16=16
esp8285.menu.led.16.build.led=-DLED_BUILTIN=16
esp8285.menu.ip.lm2f=v2 Lower Memory
esp8285.menu.ip.lm2f.build.lwip_include=lwip2/include
esp8285.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
esp8285.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp8285.menu.ip.hb2f=v2 Higher Bandwidth
esp8285.menu.ip.hb2f.build.lwip_include=lwip2/include
esp8285.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
esp8285.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
esp8285.menu.ip.lm2n=v2 Lower Memory (no features)
esp8285.menu.ip.lm2n.build.lwip_include=lwip2/include
esp8285.menu.ip.lm2n.build.lwip_lib=-llwip2-536
esp8285.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp8285.menu.ip.hb2n=v2 Higher Bandwidth (no features)
esp8285.menu.ip.hb2n.build.lwip_include=lwip2/include
esp8285.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
esp8285.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
esp8285.menu.ip.lm6f=v2 IPv6 Lower Memory
esp8285.menu.ip.lm6f.build.lwip_include=lwip2/include
esp8285.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
esp8285.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp8285.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
esp8285.menu.ip.hb6f.build.lwip_include=lwip2/include
esp8285.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
esp8285.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
esp8285.menu.dbg.Disabled=Disabled
esp8285.menu.dbg.Disabled.build.debug_port=
esp8285.menu.dbg.Serial=Serial
esp8285.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
esp8285.menu.dbg.Serial1=Serial1
esp8285.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
esp8285.menu.lvl.None____=None
esp8285.menu.lvl.None____.build.debug_level=
esp8285.menu.lvl.SSL=SSL
esp8285.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
esp8285.menu.lvl.TLS_MEM=TLS_MEM
esp8285.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
esp8285.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
esp8285.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
esp8285.menu.lvl.HTTP_SERVER=HTTP_SERVER
esp8285.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
esp8285.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
esp8285.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
esp8285.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
esp8285.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
esp8285.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
esp8285.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp8285.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
esp8285.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
esp8285.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp8285.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
esp8285.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
esp8285.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp8285.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp8285.menu.lvl.CORE=CORE
esp8285.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
esp8285.menu.lvl.WIFI=WIFI
esp8285.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
esp8285.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
esp8285.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
esp8285.menu.lvl.UPDATER=UPDATER
esp8285.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
esp8285.menu.lvl.OTA=OTA
esp8285.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
esp8285.menu.lvl.OOM=OOM
esp8285.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
esp8285.menu.lvl.MDNS=MDNS
esp8285.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
esp8285.menu.lvl.HWDT=HWDT
esp8285.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
esp8285.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
esp8285.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
esp8285.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
esp8285.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
