esp8266/Arduino/boards.txt
##############################################################
inventone.name=Invent One
inventone.build.board=ESP8266_GENERIC
inventone.build.variant=inventone
inventone.upload.tool=esptool
inventone.upload.maximum_data_size=81920
inventone.upload.wait_for_upload_port=true
inventone.upload.erase_cmd=
inventone.serial.disableDTR=true
inventone.serial.disableRTS=true
inventone.build.mcu=esp8266
inventone.build.core=esp8266
inventone.build.spiffs_pagesize=256
inventone.build.debug_port=
inventone.build.debug_level=
inventone.menu.xtal.80=80 MHz
inventone.menu.xtal.80.build.f_cpu=80000000L
inventone.menu.xtal.160=160 MHz
inventone.menu.xtal.160.build.f_cpu=160000000L
inventone.menu.vt.flash=Flash
inventone.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
inventone.menu.vt.heap=Heap
inventone.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
inventone.menu.vt.iram=IRAM
inventone.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
inventone.menu.exception.legacy=Legacy (new can return nullptr)
inventone.menu.exception.legacy.build.exception_flags=-fno-exceptions
inventone.menu.exception.legacy.build.stdcpp_lib=-lstdc++
inventone.menu.exception.disabled=Disabled (new can abort)
inventone.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
inventone.menu.exception.disabled.build.stdcpp_lib=-lstdc++
inventone.menu.exception.enabled=Enabled
inventone.menu.exception.enabled.build.exception_flags=-fexceptions
inventone.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
inventone.menu.stacksmash.disabled=Disabled
inventone.menu.stacksmash.disabled.build.stacksmash_flags=
inventone.menu.stacksmash.enabled=Enabled
inventone.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
inventone.menu.ssl.all=All SSL ciphers (most compatible)
inventone.menu.ssl.all.build.sslflags=
inventone.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
inventone.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
inventone.upload.resetmethod=--before default_reset --after hard_reset
inventone.build.flash_mode=dio
inventone.build.flash_flags=-DFLASHMODE_DIO
inventone.build.flash_freq=40
inventone.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
inventone.menu.eesz.4M2M.build.flash_size=4M
inventone.menu.eesz.4M2M.build.flash_size_bytes=0x400000
inventone.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
inventone.menu.eesz.4M2M.build.spiffs_pagesize=256
inventone.menu.eesz.4M2M.upload.maximum_size=1044464
inventone.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
inventone.menu.eesz.4M2M.build.spiffs_start=0x200000
inventone.menu.eesz.4M2M.build.spiffs_end=0x3FA000
inventone.menu.eesz.4M2M.build.spiffs_blocksize=8192
inventone.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
inventone.menu.eesz.4M3M.build.flash_size=4M
inventone.menu.eesz.4M3M.build.flash_size_bytes=0x400000
inventone.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
inventone.menu.eesz.4M3M.build.spiffs_pagesize=256
inventone.menu.eesz.4M3M.upload.maximum_size=1044464
inventone.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
inventone.menu.eesz.4M3M.build.spiffs_start=0x100000
inventone.menu.eesz.4M3M.build.spiffs_end=0x3FA000
inventone.menu.eesz.4M3M.build.spiffs_blocksize=8192
inventone.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
inventone.menu.eesz.4M1M.build.flash_size=4M
inventone.menu.eesz.4M1M.build.flash_size_bytes=0x400000
inventone.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
inventone.menu.eesz.4M1M.build.spiffs_pagesize=256
inventone.menu.eesz.4M1M.upload.maximum_size=1044464
inventone.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
inventone.menu.eesz.4M1M.build.spiffs_start=0x300000
inventone.menu.eesz.4M1M.build.spiffs_end=0x3FA000
inventone.menu.eesz.4M1M.build.spiffs_blocksize=8192
inventone.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
inventone.menu.eesz.4M.build.flash_size=4M
inventone.menu.eesz.4M.build.flash_size_bytes=0x400000
inventone.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
inventone.menu.eesz.4M.build.spiffs_pagesize=256
inventone.menu.eesz.4M.upload.maximum_size=1044464
inventone.menu.eesz.4M.build.rfcal_addr=0x3FC000
inventone.menu.ip.lm2f=v2 Lower Memory
inventone.menu.ip.lm2f.build.lwip_include=lwip2/include
inventone.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
inventone.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
inventone.menu.ip.hb2f=v2 Higher Bandwidth
inventone.menu.ip.hb2f.build.lwip_include=lwip2/include
inventone.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
inventone.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
inventone.menu.ip.lm2n=v2 Lower Memory (no features)
inventone.menu.ip.lm2n.build.lwip_include=lwip2/include
inventone.menu.ip.lm2n.build.lwip_lib=-llwip2-536
inventone.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
inventone.menu.ip.hb2n=v2 Higher Bandwidth (no features)
inventone.menu.ip.hb2n.build.lwip_include=lwip2/include
inventone.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
inventone.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
inventone.menu.ip.lm6f=v2 IPv6 Lower Memory
inventone.menu.ip.lm6f.build.lwip_include=lwip2/include
inventone.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
inventone.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
inventone.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
inventone.menu.ip.hb6f.build.lwip_include=lwip2/include
inventone.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
inventone.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
inventone.menu.dbg.Disabled=Disabled
inventone.menu.dbg.Disabled.build.debug_port=
inventone.menu.dbg.Serial=Serial
inventone.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
inventone.menu.dbg.Serial1=Serial1
inventone.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
inventone.menu.lvl.None____=None
inventone.menu.lvl.None____.build.debug_level=
inventone.menu.lvl.SSL=SSL
inventone.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
inventone.menu.lvl.TLS_MEM=TLS_MEM
inventone.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
inventone.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
inventone.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
inventone.menu.lvl.HTTP_SERVER=HTTP_SERVER
inventone.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
inventone.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
inventone.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
inventone.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
inventone.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
inventone.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
inventone.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
inventone.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
inventone.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
inventone.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
inventone.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
inventone.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
inventone.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
inventone.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
inventone.menu.lvl.CORE=CORE
inventone.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
inventone.menu.lvl.WIFI=WIFI
inventone.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
inventone.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
inventone.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
inventone.menu.lvl.UPDATER=UPDATER
inventone.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
inventone.menu.lvl.OTA=OTA
inventone.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
inventone.menu.lvl.OOM=OOM
inventone.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
inventone.menu.lvl.MDNS=MDNS
inventone.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
inventone.menu.lvl.HWDT=HWDT
inventone.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
inventone.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
inventone.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
inventone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
inventone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
inventone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
inventone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
inventone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
inventone.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
inventone.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
inventone.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
inventone.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
inventone.menu.wipe.none=Only Sketch
inventone.menu.wipe.none.upload.erase_cmd=
inventone.menu.wipe.sdk=Sketch + WiFi Settings
inventone.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
inventone.menu.wipe.all=All Flash Contents
inventone.menu.wipe.all.upload.erase_cmd=erase_flash
inventone.menu.baud.115200=115200
inventone.menu.baud.115200.upload.speed=115200
inventone.menu.baud.57600=57600
inventone.menu.baud.57600.upload.speed=57600
inventone.menu.baud.230400.linux=230400
inventone.menu.baud.230400.macosx=230400
inventone.menu.baud.230400.upload.speed=230400
inventone.menu.baud.256000.windows=256000
inventone.menu.baud.256000.upload.speed=256000
inventone.menu.baud.460800.linux=460800
inventone.menu.baud.460800.macosx=460800
inventone.menu.baud.460800.upload.speed=460800
inventone.menu.baud.512000.windows=512000
inventone.menu.baud.512000.upload.speed=512000
inventone.menu.baud.921600=921600
inventone.menu.baud.921600.upload.speed=921600
inventone.menu.baud.3000000=3000000
inventone.menu.baud.3000000.upload.speed=3000000

