esp8266/Arduino/boards.txt
##############################################################
cw01.name=XinaBox CW01
cw01.build.board=ESP8266_GENERIC
cw01.build.variant=xinabox
cw01.upload.tool=esptool
cw01.upload.maximum_data_size=81920
cw01.upload.wait_for_upload_port=true
cw01.upload.erase_cmd=
cw01.serial.disableDTR=true
cw01.serial.disableRTS=true
cw01.build.mcu=esp8266
cw01.build.core=esp8266
cw01.build.spiffs_pagesize=256
cw01.build.debug_port=
cw01.build.debug_level=
cw01.menu.xtal.80=80 MHz
cw01.menu.xtal.80.build.f_cpu=80000000L
cw01.menu.xtal.160=160 MHz
cw01.menu.xtal.160.build.f_cpu=160000000L
cw01.menu.vt.flash=Flash
cw01.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
cw01.menu.vt.heap=Heap
cw01.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
cw01.menu.vt.iram=IRAM
cw01.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
cw01.menu.exception.legacy=Legacy (new can return nullptr)
cw01.menu.exception.legacy.build.exception_flags=-fno-exceptions
cw01.menu.exception.legacy.build.stdcpp_lib=-lstdc++
cw01.menu.exception.disabled=Disabled (new can abort)
cw01.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
cw01.menu.exception.disabled.build.stdcpp_lib=-lstdc++
cw01.menu.exception.enabled=Enabled
cw01.menu.exception.enabled.build.exception_flags=-fexceptions
cw01.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
cw01.menu.stacksmash.disabled=Disabled
cw01.menu.stacksmash.disabled.build.stacksmash_flags=
cw01.menu.stacksmash.enabled=Enabled
cw01.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
cw01.menu.ssl.all=All SSL ciphers (most compatible)
cw01.menu.ssl.all.build.sslflags=
cw01.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
cw01.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
cw01.upload.resetmethod=--before default_reset --after hard_reset
cw01.menu.CrystalFreq.26=26 MHz
cw01.menu.CrystalFreq.40=40 MHz
cw01.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
cw01.build.flash_mode=dio
cw01.build.flash_flags=-DFLASHMODE_DIO
cw01.build.flash_freq=40
cw01.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
cw01.menu.eesz.4M2M.build.flash_size=4M
cw01.menu.eesz.4M2M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
cw01.menu.eesz.4M2M.build.spiffs_pagesize=256
cw01.menu.eesz.4M2M.upload.maximum_size=1044464
cw01.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
cw01.menu.eesz.4M2M.build.spiffs_start=0x200000
cw01.menu.eesz.4M2M.build.spiffs_end=0x3FA000
cw01.menu.eesz.4M2M.build.spiffs_blocksize=8192
cw01.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
cw01.menu.eesz.4M3M.build.flash_size=4M
cw01.menu.eesz.4M3M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
cw01.menu.eesz.4M3M.build.spiffs_pagesize=256
cw01.menu.eesz.4M3M.upload.maximum_size=1044464
cw01.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
cw01.menu.eesz.4M3M.build.spiffs_start=0x100000
cw01.menu.eesz.4M3M.build.spiffs_end=0x3FA000
cw01.menu.eesz.4M3M.build.spiffs_blocksize=8192
cw01.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
cw01.menu.eesz.4M1M.build.flash_size=4M
cw01.menu.eesz.4M1M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
cw01.menu.eesz.4M1M.build.spiffs_pagesize=256
cw01.menu.eesz.4M1M.upload.maximum_size=1044464
cw01.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
cw01.menu.eesz.4M1M.build.spiffs_start=0x300000
cw01.menu.eesz.4M1M.build.spiffs_end=0x3FA000
cw01.menu.eesz.4M1M.build.spiffs_blocksize=8192
cw01.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
cw01.menu.eesz.4M.build.flash_size=4M
cw01.menu.eesz.4M.build.flash_size_bytes=0x400000
cw01.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
cw01.menu.eesz.4M.build.spiffs_pagesize=256
cw01.menu.eesz.4M.upload.maximum_size=1044464
cw01.menu.eesz.4M.build.rfcal_addr=0x3FC000
cw01.menu.ip.lm2f=v2 Lower Memory
cw01.menu.ip.lm2f.build.lwip_include=lwip2/include
cw01.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
cw01.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
cw01.menu.ip.hb2f=v2 Higher Bandwidth
cw01.menu.ip.hb2f.build.lwip_include=lwip2/include
cw01.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
cw01.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
cw01.menu.ip.lm2n=v2 Lower Memory (no features)
cw01.menu.ip.lm2n.build.lwip_include=lwip2/include
cw01.menu.ip.lm2n.build.lwip_lib=-llwip2-536
cw01.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
cw01.menu.ip.hb2n=v2 Higher Bandwidth (no features)
cw01.menu.ip.hb2n.build.lwip_include=lwip2/include
cw01.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
cw01.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
cw01.menu.ip.lm6f=v2 IPv6 Lower Memory
cw01.menu.ip.lm6f.build.lwip_include=lwip2/include
cw01.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
cw01.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
cw01.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
cw01.menu.ip.hb6f.build.lwip_include=lwip2/include
cw01.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
cw01.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
cw01.menu.dbg.Disabled=Disabled
cw01.menu.dbg.Disabled.build.debug_port=
cw01.menu.dbg.Serial=Serial
cw01.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
cw01.menu.dbg.Serial1=Serial1
cw01.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
cw01.menu.lvl.None____=None
cw01.menu.lvl.None____.build.debug_level=
cw01.menu.lvl.SSL=SSL
cw01.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
cw01.menu.lvl.TLS_MEM=TLS_MEM
cw01.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
cw01.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
cw01.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.HTTP_SERVER=HTTP_SERVER
cw01.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
cw01.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
cw01.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
cw01.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
cw01.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
cw01.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
cw01.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
cw01.menu.lvl.CORE=CORE
cw01.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
cw01.menu.lvl.WIFI=WIFI
cw01.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
cw01.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
cw01.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
cw01.menu.lvl.UPDATER=UPDATER
cw01.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
cw01.menu.lvl.OTA=OTA
cw01.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
cw01.menu.lvl.OOM=OOM
cw01.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
cw01.menu.lvl.MDNS=MDNS
cw01.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
cw01.menu.lvl.HWDT=HWDT
cw01.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
cw01.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
cw01.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
cw01.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
cw01.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
cw01.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
cw01.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
cw01.menu.wipe.none=Only Sketch
cw01.menu.wipe.none.upload.erase_cmd=
cw01.menu.wipe.sdk=Sketch + WiFi Settings
cw01.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
cw01.menu.wipe.all=All Flash Contents
cw01.menu.wipe.all.upload.erase_cmd=erase_flash
cw01.menu.baud.115200=115200
cw01.menu.baud.115200.upload.speed=115200
cw01.menu.baud.57600=57600
cw01.menu.baud.57600.upload.speed=57600
cw01.menu.baud.230400.linux=230400
cw01.menu.baud.230400.macosx=230400
cw01.menu.baud.230400.upload.speed=230400
cw01.menu.baud.256000.windows=256000
cw01.menu.baud.256000.upload.speed=256000
cw01.menu.baud.460800.linux=460800
cw01.menu.baud.460800.macosx=460800
cw01.menu.baud.460800.upload.speed=460800
cw01.menu.baud.512000.windows=512000
cw01.menu.baud.512000.upload.speed=512000
cw01.menu.baud.921600=921600
cw01.menu.baud.921600.upload.speed=921600
cw01.menu.baud.3000000=3000000
cw01.menu.baud.3000000.upload.speed=3000000

